// - Створити функцію конструктор яка дозволяє створювати обєкти car, з властивостями модель, виробник, рік випуску,
// максимальна швидкість, обєм двигуна. додати в обєкт функції:
// -- drive () - яка виводить в консоль `їдемо зі швидкістю ${максимальна швидкість} на годину`
// -- info () - яка виводить всю інформацію про автомобіль в форматі `назва поля - значення поля`
// -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// -- changeYear (newValue) - змінює рік випуску на значення newValue
// -- addDriver (driver) - приймає обєкт який "водій" з довільним набором полів, і додає його в поточний обєкт car
function Car(model, producer, year, maxSpeed, engineVol, drive, info) {
    this.model = model;
    this.producer = producer;
    this.year = year;
    this.maxSpeed = maxSpeed;
    this.engineVol = engineVol;
    this.drive = () => console.log(`їдемо зі швидкістю ${maxSpeed} на годину`);
    this.info = () => {
        for (const key in this) {

        }
        this.info('Рабочий объем, л', 3);
        this.info('Рабочий объем, см3' - 2985);
        this.info('Диаметр цилиндра' - 91);
        this.info('Количество цилиндров' - 6);
        this.info('Максимальная мощность, кВт' - 175);
        this.info('Максимальная мощность, л.с.' - 238);
        this.info('Номинальный крутящий момент, Н•м' - 295);
    }


let newCar = new Car('Grand Cherokee', ' Jeep', 2021, 190, 3);
console.log(newCar);
newCar.drive();
newCar.info();


// - (Те саме, тільки через клас)
// Створити клас який дозволяє створювати обєкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість,
// обєм двигуна. додати в обєкт функції:
// -- drive () - яка виводить в консоль `їдемо зі швидкістю ${максимальна швидкість} на годину`
// -- info () - яка виводить всю інформацію про автомобіль в форматі `назва поля - значення поля`
// -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// -- changeYear (newValue) - змінює рік випуску на значення newValue
// -- addDriver (driver) - приймає обєкт який "водій" з довільним набором полів, і додає його в поточний обєкт car
//
//
//
// -створити класс/функцію конструктор попелюшка з полями імя, вік, розмір ноги. Створити масив з 10 попелюшок.
// Сторити обєкт класу "принц" за допомоги класу який має поля імя, вік, туфелька яку він знайшов.
//     За допомоги циклу знайти яка попелюшка повинна бути з принцом.
//     Додатково, знайти необхідну попелюшку за допомоги функції масиву find та відповідного колбеку