// - Дано натуральное число n. Выведите все числа от 1 до n.
// let nLog = (n) => {
//     for (let i = 1; i <= n; i++) {
//         console.log(i);
//     }
// };
// nLog(15);

// - Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания если A < B,
// или в порядке убывания в противном случае.
// let funcNum = (a, b) => {
//     for (let i = a; i <= b; i++) {
//         if (a < b) {
//             console.log(i);
//         }
//     }
//     for (let j = a; j >= b; j--) {
//         if (a > b) {
//             console.log(j);
//         }
//     }
// };
// funcNum(4, 9);
// funcNum(12, 5);

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

let numChange = (array, i) => {

};
numChange([9, 8, 0, 4], 0);
numChange([9, 8, 0, 4], 1);
numChange([9, 8, 0, 4], 2);


// - Створити функцію яка буде переносити елементи з значенням 0 у кінець масиву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]